app/controllers/avisos_controller.rb

  def index
    @avisos = Aviso.all.page(params[:page])
---
SELECT  "avisos".* FROM "avisos" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "avisos"

  def create
    @aviso = Aviso.new(aviso_params)

    respond_to do |format|
      if @aviso.save
---
INSERT INTO "avisos" ("title", "description", "created_at", "updated_at", "category_id", "photo_file_name", "photo_content_type", "photo_file_size", "photo_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_aviso
      @aviso = Aviso.find(params[:id])
---
SELECT  "avisos".* FROM "avisos" WHERE "avisos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]