app/controllers/categories_controller.rb

  def show
    #@category = Category.find(params[:id])
    @avisos = Aviso.where(category_id: params[:id])
---
SELECT "avisos".* FROM "avisos" WHERE "avisos"."category_id" = ?  [["category_id", 2]]

  def set_id
    @category = Category.find(params[:id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]