app/controllers/communicates_controller.rb

  def create
    @communicate = Communicate.new(communicate_params)

    respond_to do |format|
      if @communicate.save
---
INSERT INTO "communicates" ("message", "sender_id", "publisher_id", "aviso_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["message", "Hola! Que tal como leva?"], ["sender_id", 17], ["publisher_id", 16], ["aviso_id", 1], ["created_at", 2016-11-05 22:13:10 UTC], ["updated_at", 2016-11-05 22:13:10 UTC]]