app/controllers/users_controller.rb

  def finish_signup
    # authorize! :update, @user
    if request.patch? && params[:user] #&& params[:user][:email]
      if @user.update(user_params)
---
UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "wencessz@gmail.com"], ["updated_at", 2016-11-05 22:02:23 UTC], ["id", 17]]