app/controllers/users/registrations_controller.rb

  def create
    @user = User.new(sign_up_params)

    respond_to do |format|
      if @user.save

        if params[:user][:roles] == "publisher"
          @user.add_role :publisher
        else
          @user.add_role :hunter
        end
        @user.save
---
INSERT INTO "users" ("name", "phone", "location", "created_at", "updated_at", "email", "encrypted_password", "confirmation_token", "confirmation_sent_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "roles" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "hunter"], ["created_at", 2016-11-05 19:19:32 UTC], ["updated_at", 2016-11-05 19:19:32 UTC]]